#### RailingPlacementPosition Enumeration

---

|  |
| --- |
| See Also |

Railing placement position.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailingPlacementPosition ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailingPlacementPosition ``` |

| Visual C++ |
| --- |
| ``` public enum class RailingPlacementPosition ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | No railing placement. |
| Treads | Places railing on treads. |
| Stringer | Places railing on stringer. |

# See Also

Autodesk.Revit.DB.Architecture Namespace